//#include "iostream"
//using namespace std;
////对象初始化和清理
////1.构造函数 进行初始化操作
//class person {
//public:
//	//没有返回值，不用写void
//	//函数名与类相同
//	//构造函数可以有参数，可以发生重载
//	// 创建对象的时候，构造函数会自动调用，而且只调用一次
//	person()
//	{
//		cout<<"我是构造函数" << endl;
//	}
//	//2析构函数 进行清理工作.
//	//没有返回值，不用写void
//	//函数名与类相同 在名字前加~
//	//没有参数，不能发生重载
//	//对象在销毁前 会调用析构函数，而且只会调用一次
//	~person()
//	{
//		cout << "我是析构函数" << endl;
//	}
//
//};
//void test01()
//{
//	person p;//在栈区上数据
//}
//
//int main() 
//{
//	test01();
//	return 0;
//}